# ⁡⁢⁢⁣𝟭) მომხმარებელმა უნდა შეიყვანოს ორი რიცხვი.
# პროგრამამ უნდა დაბეჭდოს შედეგი — 𝙏𝙧𝙪𝙚, თუ ორივე დადებითია, ხოლო თუ ერთი მაინც არასწორი იქნება 𝙁𝙖𝙡𝙨𝙚.

# 𝟮) შექმენი ორი ცვლადი ერთი 𝙚𝙢𝙖𝙞𝙡 მეორე 𝙥𝙖𝙨𝙨𝙬𝙤𝙧𝙙 ამ ორივე ცვლადს მიანიჭეთ შესაბამისი მნიშვნელობა. შემდეგ მომხმარებელს შემოატანინე ემაილი და პაროლი. საბოლოოდ დაბეჭდე თუ შენი ემაილი უდრის მომხმარებლის შემოყვანილ ემაილს და შენი პაროლი თუ უდრის მომხმარებლის შემოყვანილ პაროლს.

# 𝟯) 𝙥𝙧𝙞𝙣𝙩(𝟭𝟮==𝟭𝟯 𝙤𝙧 𝟭𝟮==𝟭𝟮 𝙖𝙣𝙙 𝟮𝟭>𝟮𝟬) კომენტარებით მიუწერე რა იქნება შედეგი და თან ახსენი რატომ. არ ნახო შედეგი!⁡

num1 = float(input("შეიყვანე პირველი რიცხვი: "))
num2 = float(input("შეიყვანე მეორე რიცხვი: "))

result = num1 > 0 and num2 > 0


print("ორივე რიცხვი დადებითია?", result)


correct_email = "niko.chrikishvili@gmail.com"
correct_password = "nika08"

user_email = input("შეიყვანე შენი ემაილი: ")
user_password = input("შეიყვანე პაროლი: ")

if user_email == correct_email and user_password == correct_password:
    print("წარმატებული შესვლა! ✓")
else:
    print("ემაილი ან პაროლი არასწორია ✗")


