# ⁡⁢⁢⁣𝟭)შემოიტანეთ თქვენი ოჯახის წევრების ასაკი და დაუპრინტეთ თუ რამდენი წლისები იქნებიან 𝟮𝟱 წლის შემდეგ(გამოიყენეთ 𝙞𝙣𝙩 ფუნქცია).
# 𝟮)მომხმარებელს შემოატანინეთ მისი სახელი და 𝙩𝙮𝙥𝙚 ფუნქციის საშუალებით გაიგეთ რა ტიპის მონაცემია შემოტანილი მნიშვნელობა.
# 𝟯)მომხმარებელს შემოატანინეთ მისი ასაკი და შემდეგ გადააქციეთ სტრინგად
# 𝟰)კომენტარებით ახსენით რას აკეთებს 𝙨𝙩𝙧(),𝙞𝙣𝙩() და 𝙛𝙡𝙤𝙖𝙩() ფუნქციები.
# 𝟱)აუცილებლად გადახედეთ ჩანაწერს⁡

mom_age = int(input("დედას ასაკი"))
dad_age = int(input("მამას ასაკი"))
sister_age = int(input("დის ასაკი"))
your_age = int(input("შენი ასაკი"))

print("25 წლის შემდეგ თქვენ იქნებით")
print("დედა იქნება:", mom_age + 25, "წლის")
print("მამა იქნება: ", dad_age + 25, "წლის")
print("და იქნება:", sister_age + 25, "წლის")
print("შენ იქნება:", your_age + 25, "წლის")

# ⁡⁢⁣⁣---------------------------------------------⁡

name = input("შეიყვანე სახელი")

print("სეიყვანილი სახელი:",name)
print("მონაცემის ტიპი",type(name))

# ⁡⁢⁣⁡⁢⁣⁣---------------------------------------------⁡

age = int(input("შე~იყვანე თქვენი ასაკი"))
age_as_string = str(age)

print(age,type(age))
print(age_as_string,type(age_as_string))
