# ⁡⁢⁢⁣𝟭) შეასრულეთ 𝙎𝙤𝙡𝙤𝙡𝙚𝙖𝙧𝙣 ეს ორი თავი +

# 𝟮) შექმენი ცვლადი რომელსაც დაარქმევთ 𝙣𝙖𝙢𝙚-ს და მნიშვნელობად გადაეცით თქვენი სახელი, შექმენი მეორე ცვლადი რომელსაც დაარქმევთ 𝙇𝙖𝙨𝙩𝙉𝙖𝙢𝙚-ს და მნიშვნელობად გადაეცით თქვენი გვარი და საბოლოოდ დაპრინტეთ ცალ-ცალკე.

# 𝟯) შექმენი ოთხი ცვლადი პირველ ცვლადს გადაეცით ინტეჯერი, მეორეს სტრინგი, მესამეს ფლოუთი, მეოთხეს ბულეანი და საბოლოოდ დაპრინტეთ ცალ-ცალკე

# 𝟰) შექმენით იმდენი ცვლადი რამდენი ოჯახის წევრიც გყავთ. თითოეულს მნიშვნელობად მიანიჭეთ თქვენი ოჯახის წევრების ასაკი და საბოლოოდ შეკრიბეთ თითოეული ოჯახის წევრის ასაკი.

# 𝟱) აუცილებლად გადახედეთ დღევანდელი გაკვეთილის ჩანაწერს.⁡

name = "Nika"
last_name = "Tchrikishvili"

print(name)
print(last_name)

age = 17
city = "Tbilisi"
height = 1.74
is_student = True

print(age)
print(city)
print(height)
print(is_student)

mama = 42
deda = 45
me = 17
da = 11

total_age = mama + deda + me + da

print("მამა:", mama, "წლის")
print("დედა:", deda, "წლის")
print("ძმა:", me, "წლის")
print("და:", da, "წლის")
print("ოჯახის წევრების ასაკების ჯამი:", total_age, "წელი")

