# ⁡⁢⁢⁣𝟭) კომენტარებით ახსენი რა არის 𝙨𝙚𝙦𝙪𝙚𝙣𝙘𝙞𝙣𝙜, 𝙞𝙩𝙚𝙧𝙖𝙩𝙞𝙤𝙣 და 𝙨𝙚𝙡𝙚𝙘𝙩𝙞𝙤𝙣-ი მოიყვანე მაგალითები.

# 𝟮) კომენტარებით ახსენი რა არის საიტერაციო ცვლადი.

# 𝟯) შექმენი ფორ ციკლი რომელიც გამოიტანს 𝟭-დან 𝟮𝟬 ამდე რიცხვებს და ყოველ იტერაციზე უნდა დაემატოს(𝙨𝙩𝙚𝙥) 𝟮-იანი ანუ შედეგად გამოვა კენტი რიცხვები.

# 𝟰)  შექმენი ფორ ციკლი რომელიც გამოიტანს 𝟬-დან 𝟱𝟬 ამდე რიცხვებს და ყოველ იტერაციზე უნდა დაემატოს(𝙨𝙩𝙚𝙥) 𝟮-იანი ანუ შედეგად გამოვა ლუწ რიცხვები.

# 𝟱) შექმენი ციკლი სადაც გამოიტან შენ სახელს 𝟭𝟱 ჯერ.⁡



# 1. Sequencing (თანმიმდევრობა) - კოდის ხაზობრივად, თანმიმდევრობით შესრულება
print("დილა მშვიდობისა")
name = "ნიკოლოზ"
print("გამარჯობა", name)
print("დღეს კარგი დღეა")

# 2. Selection (არჩევანი / განშტოება) - გადაწყვეტილების მიღება პირობის მიხედვით
age = 17
if age >= 18:
    print("შენ ზრდასრული ხარ")
else:
    print("შენ ჯერ არასრულწლოვანი ხარ")

# 3. Iteration (გამეორება / ციკლი) - ერთი და იგივე მოქმედების მრავალჯერ გამეორება
for i in range(5):
    print("ეს ტექსტი გამეორდება 5-ჯერ")


    # საიტერაციო ცვლადი არის ის ცვლადი, რომელიც ციკლის თითოეულ გამეორებაზე (იტერაციაზე)
# იღებს ახალ მნიშვნელობას ციკლის კოლექციიდან/დიაპაზონიდან

for number in range(1, 6):     # აქ number არის საიტერაციო ცვლადი
    print(number)              # ყოველ ჯერზე იღებს ახალ მნიშვნელობას: 1 → 2 → 3 → 4 → 5

# კიდევ ერთი მაგალითი:
სახელები = ["გიორგი", "ედიტა", "ნატა", "ნიკოლოზ"]

for სახელი in სახელები:       # აქ სახელი არის საიტერაციო ცვლადი
    print("გამარჯობა", სახელი)


# ვიწყებთ 1-დან, ვამატებთ 2-ს ყოველ ჯერზე → გამოდის კენტები
for i in range(1, 21, 2):
    print(i)
    
# შედეგი:
# 1
# 3
# 5
# 7
# 9
# 11
# 13
# 15
# 17
# 19


# ვიწყებთ 0-დან, ვამატებთ 2-ს ყოველ ჯერზე → გამოდის ლუწები
for i in range(0, 51, 2):
    print(i)
    
# შედეგი:
# 0
# 2
# 4
# ...
# 46
# 48
# 50



# ყველაზე მარტივი გზა
for _ in range(15):           # _ ნიშნავს "არ გვჭირდება ეს ცვლადი"
    print("ნიკოლოზ")

# ან უფრო ლამაზად:
for i in range(1, 16):
    print(f"{i}. ნიკოლოზ")