# ⁡⁢⁢⁣𝟭) კომენტარის საშუალებით  დაწერე რომლებია მკაცრი და არამკაცრი ოპერატორები.

# 𝟮) შექმენი ცვლადი და გადაეცი შენს მიერ  მოფიქრებული პაროლი, შემდეგ მომხმარებელს შეაყვანინე პაროლი და საბოლოოდ შეადარე უდრის თუ არა შენი პაროლი მომხმარებლის შემოყვანილ პაროლს.

# 𝟯) შექმენი ცვლადი, სადაც შენახული იქნება შენი ასაკი. შემდეგ დაბეჭდე  არის თუ არა შენი ასაკი ნაკლები 𝟭𝟬-ზე.

# 𝟰) შექმენი 𝟱 სხვადასხვა შედარება, რომლებიც ყველა დააბრუნებს 𝙏𝙧𝙪𝙚.

# 𝟱) შექმენი 𝟱 სხვადასხვა შედარება, რომლებიც ყველა დააბრუნებს 𝙁𝙖𝙡𝙨𝙚.⁡


secret_password = "aliosha123"

user_password = input("შეიყვანე პროლი:")

if user_password == secret_password:
    print("მოგესალმებით სისტემაში")
else:
    print("სამწუხაროდ პაროლი არასწორია სცადეთ კიდევ ერთხელ")

# ⁡⁢⁣⁣--------------------------------------------------------------------------⁡

my_age = 17
print(f"ჩემი ასაკი: {my_age}")
print("არის თუ არა ჩემი ასაკი 10-ზე ნაკლები?", my_age < 10)

# ⁡⁢⁣⁣--------------------------------------------------------------------------⁡

print("5 შედარება რომლებიც True-ს გვიბრუნებს:")
print(5 + 3 == 8)
print(10 != 7)
print("hello" != "Hello")
print(15 >= 15)
print(3 * 4 <= 13)
print()


print("5 შედარება რომლებიც False-ს გვიბრუნებს:")
print(100 == 99)
print(7 > 19)
print("python" == "Python")
print(25 < 20)
print(50 != 50)