# ⁡⁢⁢⁣𝟭) შეასრულე 𝗦𝗼𝗹𝗼𝗹𝗲𝗮𝗿𝗻-ის ეს ერთი თავი

# 𝟮) დაწერე პროგრამა, რომელიც 𝘄𝗵𝗶𝗹𝗲 ციკლის მეშვეობით ბეჭდავს რიცხვებს 𝟭-დან 𝟭𝟬-მდე.

# 𝟯) დაწერე პროგრამა, რომელიც 𝘄𝗵𝗶𝗹𝗲 ციკლით ბეჭდავს რიცხვებს უკუღმა — 𝟭𝟬-დან 𝟭-მდე.

# 𝟰) დაწერე პროგრამა, რომელიც ითხოვს მომხმარებლისგან სახელს და არ ჩერდება მანამ, სანამ სწორ სახელს არ შეიყვანს.თუ მომხმარებელი შეიყვანს სხვა სახელს, პროგრამამ უნდა სთხოვოს თავიდან შეიყვანოს.როდესაც სწორი სახელი იქნება შეყვანილი — პროგრამამ უნდა დაბეჭდოს, რომ პასუხი სწორია.

# 𝟱) გადახედეთ დღევანდელ ჩანაწერს.

# 𝟲) აუცილებლად უყურეთ ამ ვიდეოს:𝗵𝘁𝘁𝗽𝘀://𝘄𝘄𝘄.𝘆𝗼𝘂𝘁𝘂𝗯𝗲.𝗰𝗼𝗺/𝘄𝗮𝘁𝗰𝗵?𝘃=𝗿𝗥𝗧𝗷𝗣𝗻𝗩𝗼𝗼𝘅𝗘⁡

i = 1
while i <= 10:
    print(i)
    i += 1

# 3.
i = 10
while i >= 1:
    print(i)
    i -= 1

# 4. 

correct_name = "ნიკოლოზ"

print("შეიყვანე შენი სახელი:")

while True:
    user_name = input("→ ").strip()  

    if user_name == correct_name:
        print("პასუხი სწორია! კეთილი იყოს შენი მობრძანება 😊")
        break  
    else:
        print("არასწორია... სცადე კიდევ ერთხელ.")
        
