# ⁡⁢⁢⁣𝟭)აუცილებლად დარეგისტრირდით სოლოლერნზე(ჩანაწერის მიხედვით) და შეასრულეთ პირველი ორი თავი +

# 𝟮) 𝗽𝗿𝗶𝗻𝘁 ის საშუალებით ტერმინალში გამოიტანეთ თქვენი საყვარელი სკოლის საგანი
# 𝟯) 𝗽𝗿𝗶𝗻𝘁 ის საშუალებით ტერმინალში გამოიტანეთ თქვენი საყვარელი ფილმი
# 𝟰) 𝗽𝗿𝗶𝗻𝘁 ის საშუალებით ტერმინალში გამოიტანეთ თქვენი ოჯახის წევრების სახელები
# 𝟱) შექმენით ცვლადები სადაც შეინახავთ თქვენი ოჯახის წევრების სახელს და დაპრინტეთ ცალ-ცალკე⁡

print("სპორტი")
print("ჰარი პოტერი")
print("მამა-გიორგი,დედა-ედიტა,და-ნატა,მე-ნიკა")

mama = "გიორგი"
deda = "ედიტა"
sister = "ნატა"
me = "ნიკა"

print(mama)
print(deda)
print(sister)
print(me)