# ⁡⁢⁢⁣𝟭) კომენტარის სახით ახსენი, რა არის 𝘀𝗻𝗮𝗸𝗲_𝗰𝗮𝘀𝗲, 𝗰𝗮𝗺𝗲𝗹𝗖𝗮𝘀𝗲 და 𝗣𝗮𝘀𝗰𝗮𝗹𝗖𝗮𝘀𝗲.

# 𝟮) კომენტარებით ახსენი, რა არის 𝗶𝗻𝗽𝘂𝘁 და რა არის 𝗼𝘂𝘁𝗽𝘂𝘁. თითოეულზე მოიყვანე 𝟮-𝟮 მაგალითი.

# 𝟯) მომხმარებელს შეაყვანინე შენი ასაკი და შექმენი ცვლადი 𝘀𝗻𝗮𝗸𝗲_𝗰𝗮𝘀𝗲-ით. შედეგად გამოიტანე თქვენს ასაკზე 𝟭-დან 𝟭𝟬-მდე ნებისმიერი რიცხვით გამოკლებული მნიშვნელობა.

# 𝟰) შექმენი ცვლადი სახელად 𝗺𝘆_𝗻𝗮𝗺𝗲 და მომხმარებელს შეაყვანინე შენი სახელი.
# შექმენი მეორე ცვლადი სახელად 𝘂𝘀𝗲𝗿_𝗻𝗮𝗺𝗲 და მომხმარებელს შეაყვანინე შენი გვარი.
# საბოლოოდ, მოახდინე ამ ორ ცვლადზე კონკატინაცია.⁡

# snake_case - სიტყვები ერთმანეთისგან გამოყოფილია ქვედა ტირით (_), ყველა ასო პატარა
user_age = 17

# camelCase - პირველი სიტყვა იწყება პატარა ასოთი, შემდეგი სიტყვები იწყება დიდი ასოთი
UserAge = 17

# PascalCase (ანუ CapitalizedWords / UpperCamelCase) 
# ყველა სიტყვა იწყება დიდი ასოთი, სფეისები არ არის

UserProfileData = 'same data'

# ⁡⁢⁣⁣-------------------------------------------------------⁡

# input - მომხმარებლისგან ინფორმაციას მიირებს
age = input("შეიყვანე ასაკი")

#output - ეკრანზე ინფორმაციის გამოტანა 
print("Hello World")
print("შენი ასაკი",age)

# ⁡⁢⁣⁣-------------------------------------------------------⁡

my_age = int(input("შეიყვანე შენი ასაკი "))
result = my_age - 7 
print("ჩემი ასაკი მინუს 7 არის",result)

#⁡⁢⁣⁣ -------------------------------------------------------⁡
my_name = input("შეიყვანე სახელი")
user_name = input("შეიყვანე გვარი")
full_info = my_name + user_name

print("მოგესალმებით:",full_info)

