# ⁡⁢⁢⁣𝟭)ახსენით კომენტარებით რომელი მონაცემთა ტიპები გვაქვს და განმარტეთ თითოეული

# 𝟮)შექმენით ცვლადი და გაანახლეთ მნიშვნელობა სამჯერ და შემდეგ გამოიტანეთ შედეგი ტერმინალში

# 𝟯)შექმენით ორი ცვლადი სადაც გექნებათ რიცხვები შენახული, მესამე ცვლადში შეინახეთ ამ ორი ცვლადის მნიშვნელობების ჯამის შედეგი და ბოლოს გამოიტანეთ შედეგი გამოიტანეთ ეკრანზე⁡

# 1. Integer (int) - მთელი რიცხვები (დადებითი, უარყოფითი ან 0)
age = 17
temperature = -5
year = 2026

print(age,temperature,year)

# 2. Float - წილადი (ათწილადი) რიცხვები
height = 1.74
price = 19.99
average_grade = 8.4

print(height,price,average_grade)

# 3. String (str) - ტექსტური მონაცემები (სიტყვები, წინადადებები)
name = "ანა"
city = "თბილისი"

print(name,city)

# 4. Boolean (bool) - მხოლოდ ორი შესაძლო მნიშვნელობა: True ან False
is_student = True
is_raining = False
has_internet = True

print(is_student,is_raining,has_internet)

a = 45
b = 27

total = a + b

print("პირველი რიცხვი:", a)
print("მეორე რიცხვი:", b)
print("ჯამი:", total)