# ⁡⁢⁢⁣𝟭)მომხმარებელს შემოატანინეთ მისი ასაკი და გაიგეთ რამდენჯერ მოთავსდება რიცხვი 𝟭𝟬 მასში

# 𝟮)მომხმარებელს შემოატანინეთ მისი სახელი და გაიგეთ უდრის თუ არა ის თქვენს სახელს

# 𝟯)მომხმარებელს შემოატანინეთ ორი რიცხვი (𝙣𝙪𝙢𝟭 და 𝙣𝙪𝙢𝟮) და გაიგეთ რა იქნება ნაშთი, პირველი რიცხვის მეორეზე გაყოფის შემდეგ

# 𝟰)მომხმარებელს შემოატანინეთ მისი ასაკი და გაიგეთ არის თუ არა ის ლუწი (იყოფა თუ არა ზუსტად 𝟮ზე) ანუ გვრჩება თუ არა ნაშთი ნული, ორზე გაყოფის შედეგად

# 𝟱) აუცილებლად უყურეთ ჩანაწერს⁡


age = int(input("შეიყვანე შენი ასაკი: "))

how_many_times = age // 10
print("რიცხვი 10 შენს ასაკში", how_many_times, "ჯერ მოთავსდება")
print()



my_name = "ნიკოლოზ"

user_name = input("შეიყვანე შენი სახელი: ")

if user_name == my_name:
    print("ვაუ! ჩვენი სახელები ერთნაირია! 😎")
else:
    print("ჩვენი სახელები განსხვავებულია")
print()


num1 = int(input("შეიყვანე პირველი რიცხვი (num1): "))
num2 = int(input("შეიყვანე მეორე რიცხვი (num2): "))

if num2 == 0:
    print("არ შეიძლება გაყოფა 0-ზე!")
else:
    remainder = num1 % num2
    print(f"{num1} გაყოფილი {num2}-ზე ნაშთი = {remainder}")
print()



age = int(input("შეიყვანე შენი ასაკი: "))

if age % 2 == 0:
    print("შენი ასაკი ლუწია ✓")
else:
    print("შენი ასაკი კენტია")
print()



print("ნიკოლოზის მონაცემებით:")
print("17 // 10 →", 17 // 10)         
print("17 % 10 →", 17 % 10)           
print("17 % 2  →", 17 % 2)            