# ⁡⁢⁢⁣𝟭) შეასრულე 𝙎𝙤𝙡𝙤𝙡𝙚𝙖𝙧𝙣-ის ეს თავები.

# 𝟮) შექმენი ცვლადი, სადაც შენახული იქნება შენი საყვარელი ცხოველის სახელი. 
# შემდეგ მომხმარებელს შეაყვანინე ცხოველის სახელი და შეადარე ემთხვევა თუ არა შენი ცხოველი მომხმარებლის შეყვანილს.

# 𝟯) შექმენი ორი ცვლადი  ერთი შენი ასაკით, მეორე შენი საუკეთესო მეგობრის ასაკით. შეადარე არის თუ არა შენი ასაკი უფრო დიდი ვიდრე შენი მეგობრის.

# 𝟰) შექმენი 𝟭𝟬 სხვადასხვა შედარება, რომლებიც ყველა დააბრუნებს 𝙏𝙧𝙪𝙚.

# 𝟱) შექმენი 𝟭𝟬 სხვადასხვა შედარება, რომლებიც ყველა დააბრუნებს 𝙁𝙖𝙡𝙨𝙚.

# 𝟲) აუცილებლად გადახედეთ ჩანაწერს⁡


favorite_animal = "პანდა"

user_animal = input("შეიყვანეთ თქვენი საყვარელი ცხოველის სახელი:")

if user_animal.lower() == favorite_animal.lower():
    print("ვაუ ჩვენ ერთნაირი საყვარელი ცხოველი გვყავს")
else:
    print(f"საინტერესოა მე მიყვარს პანდა შენ კი - {user_animal}")

# ⁡⁢⁣⁣---------------------------------------------------------------------⁡

my_age = 17
best_friend_age = 17
print(f"ჩემი ასაკი: {my_age}")
print(f"ჩემი საუკეთესო მეგობარის ასაკი: {best_friend_age}")

if my_age > best_friend_age:
    print("მე უფროსი ვარ ჩემს საუკეთესო მეგობარზე")
else:
    print("ჩემი მეობარი უფროსია.... ან თანაბრები ვართ")


# ⁡⁢⁣⁣---------------------------------------------------------------------⁡

print("10 შედარება რომლებიც True-ს გვაძლევს:")
print(1, "10 > 4", 10 > 4)
print(2, "7 <= 7", 7 <= 7)
print(3, "15 != 16", 15 != 16)
print(4, "'cat' != 'dog'", "cat" != "dog")
print(5, "100 == 50 * 2", 100 == 50 * 2)
print(6, "3 < 99", 3 < 99)
print(7, "'hello' == 'hello'", "hello" == "hello")
print(8, "25 >= 20", 25 >= 20)
print(9, "True != False", True != False)
print(10, "(5 + 3) == 8", (5 + 3) == 8)

print("10 შედარება რომლებიც False-ს გვაძლევს:")
print(1, "50 == 49", 50 == 49)
print(2, "8 > 15", 8 > 15)
print(3, "100 <= 99", 100 <= 99)
print(4, "'Python' == 'python'", "Python" == "python")
print(5, "7 != 7 ", 7 != 7)
print(6, "42 < 30", 42 < 30)
print(7, "True == False", True == False)
print(8, "999 >= 1000", 999 >= 1000)
print(9, "'a' == 'A' ", "a" == "A")
print(10, " 20 * 5 == 80            →", 20 * 5 == 80)






