# ⁡⁢⁢⁣𝟭) შექმენი ცვლადი სადაც შეინახავ შენს სახელს შემდეგ გადაუარე 𝗳𝗼𝗿 ციკლით ცვლადს და გამოიტანე შენი სახელი  ცალ-ცალკე

# 𝟮) შექმენი 𝗳𝗼𝗿 ციკლი სადაც გამოიტან კენტ რიცხვებს 𝟭 დან 𝟯𝟬𝟬 ამდე.

# 𝟯) შექმენი 𝗳𝗼𝗿 ციკლი სადაც გამოიტან ლუწ რიცხვებს 𝟭 დან 𝟮𝟬𝟬 ამდე.

# 𝟰) გამოიტანე შენი სახელი 𝟮𝟬 ჯერ 𝗳𝗼𝗿 ციკლის დახმარებით.⁡

my_name = "Nika" 

for letter in my_name:
    print(letter)

# 2. 

for i in range(1, 301, 2):
    print(i)

# 3.

for i in range(2, 201, 2):
    print(i)

# 4.

for _ in range(20):
    print("ნიკოლოზ")
    
