# ⁡⁢⁢⁣𝟭) გააკეთეთ სოლოლერნი და აიღეთ სერტიფიკატები, ვინც დაპოსტავს და დაგვთაგავს მე და ბატონ ნიკას +𝟱𝟬 აურა


# 𝟮) შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა 𝟯 რიცხვი და ფუნქციის მიზანი იქნება, რომ ამ სამი რიცხვის ჯამი დააბრუნოს.

# 𝟯) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს მომხმარებლის სახელსა და ასაკს. ფუნქციამ უნდა დააბრუნოს მსგავსი წინადადება:
# "მომხმარებლის სახელი" 𝗶𝘀 "მომხმარებლის ასაკი" წლის.


# 𝟰)გაიაზრეთ ეს კოდი:

# 𝗱𝗲𝗳 𝘀𝘂𝗺_𝗽𝗼𝘀𝗶𝘁𝗶𝘃𝗲𝘀(𝗻𝘂𝗺𝗯𝗲𝗿𝘀):
#     𝘀𝘂𝗺 = 𝟬
#     𝗳𝗼𝗿 𝗶 𝗶𝗻 𝗻𝘂𝗺𝗯𝗲𝗿𝘀:
#         𝗶𝗳 𝗶 > 𝟬:
#             𝘀𝘂𝗺 = 𝘀𝘂𝗺 + 𝗶
#     𝗿𝗲𝘁𝘂𝗿𝗻 𝘀𝘂𝗺⁡



def sum_three(a, b, c):
    """აბრუნებს სამი რიცხვის ჯამს"""
    return a + b + c


# ტესტები
print(sum_three(5, 3, 2))      
print(sum_three(10, -4, 7))    
print(sum_three(0, 0, 0))      

def user_info(name, age):
    """აბრუნებს წინადადებას სახელისა და ასაკის შესახებ"""
    return f"{name} is {age} წლის."


# ტესტები
print(user_info("ნიკოლოზი", 20))  
print(user_info("ანა", 15))  
print(user_info("გიორგი", 35))        

def sum_positives(numbers):
    sum = 0               
    for i in numbers:      
        if i > 0:          
            sum = sum + i  
    return sum             
# მაგალი
print(sum_positives([1, -5, 3, -2, 8]))
print(sum_positives([-1, -4, 0, 7])) 
print(sum_positives([]))                
print(sum_positives([-10, -20]))       