# ⁡⁢⁢⁣𝟭) მომხმარებელს შემოატანინე  ორი რიცხვი და დაბეჭდე მათი ჯამი.

# 𝟮) მომხმარებელს შეაყვანინე სახელი, გვარი, ასაკი და საყვარელი მანქანა.
# საბოლოოდ, დაბეჭდე ერთი დიდი წინადადება ამ მონაცემებით.

# 𝟯) მომხმარებელს შეაყვანინე ორი რიცხვი და დაბეჭდე,  პირველი რიცხვი ნაშთიანად გაყოფილი მეორეზე.

# 𝟰) მომხმარებელს შეაყვანინე, რომელი პროგრამირების აკადემია მიაჩნია საუკეთესოად, და შემდეგ დაბეჭდე ეს პასუხი.

# 𝟱) აუცილებლად უყურეთ ამ ვიდეოს 𝙝𝙩𝙩𝙥𝙨://𝙬𝙬𝙬.𝙮𝙤𝙪𝙩𝙪𝙗𝙚.𝙘𝙤𝙢/𝙬𝙖𝙩𝙘𝙝?𝙫=𝘿𝘽𝟵𝘾𝙦𝟲𝙏𝙎𝙏𝙪𝙌⁡

a = float(input("შეიყვანე პირველი რიცხვი"))
b = float(input("შეიყვანე მეორე რიცხვი"))

print("Jami", a+b)

name = input("შეიყვანე შენი სახელი")
lastname = input("შეიყვანე შენი გვარი")
age = input("შეიყვანე შენი ასაკი")
car = input("შეიყვანე შენი საყვარელი მანქანა")

print(f"მე ვარ {name} {lastname}, მე ვარ {age} და ჩემი საყვარელი მანქანაა არის >>>{car}<<< ")

x = float(input('შეიყვნე ნებისმიერი რიცხვი'))
y = float(input("შეიყვანე მეორე რიცხვი (გამოყოფი)"))

if y == 0:
    print("0-ზე გამოყაფა შეუძლებელია")
else:
    print(f"{x}გაყოფილი {y}-ზე ნაშთი არის: {x % y}")


academy = input("რომელი პროგრამირების აკადემია გგონია საუკეთესო? შეიყვანე პასუხი")

print(f"შენი აზით საუკეთესო პროგრამირების აკადემია არის: {academy}")
print("კარგი არჩევანია..... ტუმცა ჩვენ ორივეე ვიცით,რომ სინამდვილეში საუკეთესო მაინც GOA-ა არის")
