# ⁡⁢⁢⁣𝟭) შექმენი ცვლადი სადაც შეინახავ შენს საყვარელ სპორტის სახელს შემდეგ 𝙛𝙤𝙧 ციკლით გადაუარეთ ცვლადს და გამოიტანეთ თქვენი საყვარელი სპორტის სახელი ცალ-ცალკე.

# 𝟮) შექმენი 𝙬𝙝𝙞𝙡𝙚 ციკლი. სადაც გამოიტან რიცხვებს 𝟭 დან 𝟭𝟬𝟬 მდე და ყოველ იტერაციაზე უნდა დაუმატო 𝟰-იანი.

# 𝟯) შექმენი 𝙛𝙤𝙧 ციკლი სადაც გამოიტან 𝟬-დან  𝟰𝟵𝟵 ის ჩათვლით ლუწ რიცხვებს.

# 𝟰) დაწერე პროგრამა, რომელიც ითხოვს მომხმარებლის საყვარელ რიცხვს და არ ჩერდება მანამ, სანამ სწორ რიცხვს არ შეიყვანს.თუ მომხმარებელი შეიყვანს სხვა ციფრს, პროგრამამ უნდა სთხოვოს თავიდან შეიყვანოს.როდესაც სწორი რიცხვი იქნება შეყვანილი — პროგრამამ უნდა დაბეჭდოს, რომ ეს პასუხი სწორია.⁡

# ჩემი საყვარელი სპორტის სახელი
favorite_sport = "კალათბურთი"

print("საყვარელი სპორტი ასო-ასო:")
for letter in favorite_sport:
    print(letter)

i = 1
while i <= 100:
    print(i)
    i += 4

# range(0, 500, 2) → 0-დან 498-მდე 
for i in range(0, 500, 2):
    print(i)

# ჩემი საყვარელი რიცხვი 
correct_number = 3

print("გამოიცანი ჩემი საყვარელი რიცხვი (1-დან 10-მდე):")

while True:
    try:
        guess = int(input("შენი რიცხვი: "))
        
        if guess == correct_number:
            print("გასაოცარია! პასუხი სწორია ✓")
            break
        else:
            print("არა... სცადე კიდევ ერთხელ!")
            
    except ValueError:
        print("გთხოვ შეიყვანე რიცხვი (ციფრები)!")

