# ⁡⁢⁢⁣```
# 𝟭) მომხმარებელს შემოატანინე  ორი რიცხვი და დაბეჭდე მათი ჯამი.

# 𝟮) მომხმარებელს შეაყვანინე სახელი, გვარი, ასაკი და საყვარელი მანქანა.
# საბოლოოდ, დაბეჭდე ერთი დიდი წინადადება ამ მონაცემებით.

# 𝟯) მომხმარებელს შეაყვანინე ორი რიცხვი და დაბეჭდე,  პირველი რიცხვი ნაშთიანად გაყოფილი მეორეზე.

# 𝟰) მომხმარებელს შეაყვანინე, რომელი პროგრამირების აკადემია მიაჩნია საუკეთესოად, და შემდეგ დაბეჭდე ეს პასუხი.

# 𝟱) აუცილებლად უყურეთ ამ ვიდეოს 𝗵𝘁𝘁𝗽𝘀://𝘄𝘄𝘄.𝘆𝗼𝘂𝘁𝘂𝗯𝗲.𝗰𝗼𝗺/𝘄𝗮𝘁𝗰𝗵?𝘃=𝗗𝗕𝟵𝗖𝗾𝟲𝗧𝗦𝗧𝘂𝗤
# ```⁡

print("ორ რიცხვთა ჯამის შეკრება <3")
a = float(input("შეიყვანე პირველი ნებისმიერი რიცხვი რომელიც გაგისწორდენა"))
b = float(input("შეიყვანე შენთვის ნებისმიერი მეორე რიცხვი <3"))

print("ჯამი იქნება=",a+b)


# ⁡⁢⁣⁣------------------------------------------------------⁡

print("შენი ზუსტი ინფორმაცია")
name = input("შეიყვანე სახელი")
lastname = input("შეიყვანე გვარი")
age = input("შეიყვანე ასაკი")

print(f"მოგესალმებით! {name} {lastname}, თქვენ ბრძანდებით {age}-წლის")


# ⁡⁢⁣⁣------------------------------------------------------⁡

print("ნაშთიანი გაყოფა")
x = float(input("პირველი რიცხვი"))
y = float(input("მეორე რიცხვი გამყოფი"))

if y == 0:
    print("0-ზე გაყოფა შეუძლებელია")
else:
    nashti = x % y 
    print(f"{x} გაყოფილი {y}-ზე მიიღება {nashti}")


# ⁡⁢⁣⁣------------------------------------------------------⁡

print("რომელი აკადემია არის საუკეთესო?")
academy = input("ჩემი აზრით საუკეთესო აკადემია არის")
print(f"შენი აზრით საუკეთესო აკადემია არის > {academy}?")
print("კარგი არჩევანია თუმცა ჩვენ ორივე კარგად ვიცით ნამდვილად რომელიცაა საუკეთესო (Goa)")
