# ⁡⁢⁢⁣𝟭) კომენტარებით ახსენი დღევანდელ გაკვეთილზე ნასწავლი მონაცემთა ტიპები და მოიყვანე თითოეულზე მაგალითი.

# 𝟮) შექმენი ცვლადი სახელად 𝙖𝙜𝙚 და მნიშვნელობად გადაეცი შენი ასაკი. საბოლოოდ დაპრინტე 𝙖𝙜𝙚  ცვლადში გადაცემულ მნიშვნელობას პლიუს 𝟴𝟳-ი

# 𝟯) 𝙣𝙖𝙢𝙚="𝙜𝙞𝙤𝙧𝙜𝙞"
#    𝙥𝙧𝙞𝙣𝙩(𝙜𝙞𝙤𝙧𝙜𝙞) რა ერორია კოდში? მიუწერეთ კომენტარის სახით⁡

# 1. integer (მთელი რიცხვები)
age = 17
temperature = -2
year = 2026

# 2. float (წილადი რიცხვები)
height = 1.74
prie = 19.99
average = 4.7

# 3. string (ტექსტი)
name = "giorgi"
city = "Tbilisi"

# 4. boolean (მხოლოდ ორი მნიშვნელობა :True,False)
is_student = True
is_raining = False 
has_phone = True

age = 17
result = age + 87 

print(result)

#⁡⁢⁣⁢ 𝗻𝗮𝗺𝗲 = "𝗚𝗶𝗼𝗿𝗴𝗶"
# 𝗽𝗿𝗶𝗻𝘁(𝗴𝗶𝗼𝗿𝗴𝗶)
# სახელი "გიორგი არ არის განსაზღვრული"⁡

#⁡⁢⁢⁢ სწორი ვარიანტი
# 𝗻𝗮𝗺𝗲 = "𝗴𝗶𝗼𝗿𝗴𝗶"
# 𝗽𝗿𝗶𝗻𝘁(𝗻𝗮𝗺𝗲)⁡

