# ⁡⁢⁢⁣ახალი მასალა არ ამიხსნია და სოლოლერნი არ გაქვთ

# 𝟭)გამოიტანეთ თქვენი სახელი და გვარი იმდენჯერ, რამდენი წლისაც ხართ

# 𝟮)გამოიტანეთ ტერმინალში რიცხვები 𝟭-დან 𝟮𝟬-ის ჩათვლით

# 𝟯)გამოიტანეთ ტერმინალში რიცხვები 𝟮𝟬-დან 𝟬-მდე

# ამ დავალებების შესასრულებლად გამოიყენეთ 𝗳𝗼𝗿 𝗹𝗼𝗼𝗽-ი


# 𝘄𝗵𝗶𝗶𝗹𝗲 𝗹𝗼𝗼𝗽𝘀:

# 𝟭)გამოიტანეთ რიცხვები 𝟭𝟬-დან 𝟭𝟱-მდე
# 𝟮)გამოიტანეთ რიცხვები 𝟱𝟬-დან 𝟬-მდე
# 𝟯)გამოიტანეთ მხოლოდ ლუწი რიცხვები 𝟭𝟬-დან 𝟳𝟬-მდე
# 𝟰)გამოიტანეთ კენტი რიცხვები 𝟮𝟱-დან 𝟱𝟱-მდე⁡

# 1) გამოიტანეთ თქვენი სახელი და გვარი იმდენჯერ, რამდენი წლისაც ხართ
name = "ნიკოლოზ ჭრიკიშვილი"
age = 17

print("1) სახელი და გვარი 17-ჯერ:")
for i in range(age):
    print(name)
print()


# 2) რიცხვები 1-დან 20-ის ჩათვლით
print("2) რიცხვები 1-დან 20-მდე:")
for i in range(1, 21):
    print(i, end=" ")
print("\n")


# 3) რიცხვები 20-დან 0-მდე (ჩათვლით)
print("3) რიცხვები 20-დან 0-მდე:")
for i in range(20, -1, -1):
    print(i, end=" ")
print("\n")


# 1) რიცხვები 10-დან 15-მდე (ჩათვლით)
print("While 1) 10-დან 15-მდე:")
i = 10
while i <= 15:
    print(i, end=" ")
    i += 1
print("\n")


# 2) რიცხვები 50-დან 0-მდე (ჩათვლით)
print("While 2) 50-დან 0-მდე:")
i = 50
while i >= 0:
    print(i, end=" ")
    i -= 1
print("\n")


# 3) მხოლოდ ლუწი რიცხვები 10-დან 70-მდე
print("While 3) ლუწი რიცხვები 10-დან 70-მდე:")
i = 10
while i <= 70:
    if i % 2 == 0:
        print(i, end=" ")
    i += 1
print("\n")


# 4) კენტი რიცხვები 25-დან 55-მდე
print("While 4) კენტი რიცხვები 25-დან 55-მდე:")
i = 25
while i <= 55:
    if i % 2 != 0:
        print(i, end=" ")
    i += 1