# ⁡⁢⁢⁣𝟭)შექმენით ცვლადები 𝙣𝙖𝙢𝙚 და 𝙨𝙪𝙧𝙣𝙖𝙢𝙚 და გამოიტანეთ ცალცალკე მათი მნიშვნელობები ტერმინალში


# 𝟮)𝙥𝙧𝙞𝙣𝙩 ფუნქციის მეშვეობით გააკეთეთ მაგალითები მათემატიკურ ოპერაციებზე

# თითო ოპერაციაზე 𝟮-𝟮 მაგალითი გააკეთეთ⁡

name = "Nikoloz"
surname = "TchrikiShvili"

print(name,surname)

print("მიმატება")
print(7 + 3 )
print(25 + 10)

print("გამოკლება")
print(10 - 3)
print(12-7)

print("გამრავლება")
print(8 * 4)
print(12*22)

print("გაყოფა")
print(10 / 2)
print(100/4)

print("მთელი'ს გაყოფა")
print(22 // 6)
print(100 // 7)

print("ნაშთი")
print(20 % 6)
print(47 % 10 )

print("ხარისხში აყვანა")
print(2 ** 3)
print(5 ** 4)