# ⁡⁢⁢⁣𝟭) შექმენი სეტი სახელად 𝙛𝙧𝙪𝙞𝙩𝙨 მასში შეინახეთ შესაბამისი 𝟱 მნიშვნელობა. წაშალეთ ერთი ნებისმიერი ხილი, ჩაამატეთ თქვენი საყვარელი ხილი, შექმენით მეორე სეტი სახელად 𝙛𝙧𝙪𝙞𝙩𝙨𝟭 შეინახეთ ორი მნიშვნელობა, ეს ორი სეტი ერთმანეთთან გააერთიანეთ და იპოვეთ ამ ორ სეტს შორის განსხვავება.

# 𝟮) დღევანდელ გაკვეთილზე ნასწავლი მეთოდები კომენტარის სახით ახსენით.

# 𝟯) შექმენი 𝙙𝙞𝙘𝙩𝙞𝙤𝙣𝙖𝙧𝙮 სადაც გექნება: სახელი, გვარი, ასაკი, საყვარელი სპორტი, საბოლოოდ დაბეჭდეთ გასაღებები, მნიშვნელობა და ყველა ერთად.⁡

fruits = {"Apple","Pear","Watermelon","Grape","Peach"}
print(fruits)

# ⁡⁢⁣⁣-----------------------------------⁡

# ხილის წაშლა
fruits.remove("Pear")
print(fruits)

# ⁡⁢⁣⁡⁢⁣⁣-----------------------------------⁡

# საყვარელი ხილის დამატება
fruits.add("Mandarin")
print(fruits)


#⁡⁢⁣⁣ -----------------------------------⁡

# მეორე სეტის შექმნა
fruits1 = ("Pineapple","Kiwi")

#⁡⁢⁣⁣ ⁡⁢⁣⁣-----------------------------------⁡

all_fruits = fruits.union(fruits1)
print(all_fruits)


difference = fruits - fruits1
print(difference)


#add() ამატებს ელემენტს სიაში
#remove() შლის ელემენტს 
#clear() შლის ყველა ელემენტს სეტიდან
#difference() ელემენტები რომლებიც არიას მხოლოდ ერთ სეტში


person = {
    "name": "Nika",
    "lastname": "Tchrikishvili",
    "age": 17,
    "sport": "swiming"
}
